package S10재귀;

import java.util.Arrays;
import java.util.Scanner;

public class No5G5_2447 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int N = sc.nextInt();

        String[][] result = star(N);
        for (String[] arr : result) {
            System.out.println(Arrays.toString(arr));
        }
    }

    /**채워야할 수 만큼 공백으로 채운다
     * 나머지는 출력할 때 null값을 *로 바꿔 출력해준다 ? */
    static String[][] star(int N) {
        String[][] starArr = new String[N][N];


        return starArr;
    }
}
/**
 *
***************************
* ** ** ** ** ** ** ** ** *
***************************
***   ******   ******   ***
* *   * ** *   * ** *   * *
***   ******   ******   ***
***************************
* ** ** ** ** ** ** ** ** *
***************************
*********         *********
* ** ** *         * ** ** *
*********         *********
***   ***         ***   ***
* *   * *         * *   * *
***   ***         ***   ***
*********         *********
* ** ** *         * ** ** *
*********         *********
***************************
* ** ** ** ** ** ** ** ** *
***************************
***   ******   ******   ***
* *   * ** *   * ** *   * *
***   ******   ******   ***
***************************
* ** ** ** ** ** ** ** ** *
***************************
 *
 * */